# ReloadSwapOutInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReloadSwapOutInfo Class
Members See Also
---
This object contains information about fabrication parts swapped out during reload.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class ReloadSwapOutInfo : IDisposable
```

Visual Basic
---
```text
Public Class ReloadSwapOutInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ReloadSwapOutInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ReloadSwapOutInfo
# See Also
ReloadSwapOutInfo Members
Autodesk.Revit.DB Namespace